lymosming/embedded-dev/stm32f103/按键控制LED/Hardware/LED.c
#include "stm32f10x.h"

void LED_Init(void){
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_SetBits(GPIOA, GPIO_Pin_3 | GPIO_Pin_4);
}

void LED1_ON(void){
	GPIO_ResetBits(GPIOA, GPIO_Pin_3);
}

void LED1_OFF(void){
	GPIO_SetBits(GPIOA, GPIO_Pin_3);
}

void LED2_ON(void){
	GPIO_ResetBits(GPIOA, GPIO_Pin_4);
}

void LED2_OFF(void){
	GPIO_SetBits(GPIOA, GPIO_Pin_4);
}

void LED1_Turn(void){
	if(GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_3) == 0){
		GPIO_SetBits(GPIOA, GPIO_Pin_3);
	}else{
		GPIO_ResetBits(GPIOA, GPIO_Pin_3);
	}
}

void LED2_Turn(void){
	if(GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_4) == 0){
		GPIO_SetBits(GPIOA, GPIO_Pin_4);
	}else{
		GPIO_ResetBits(GPIOA, GPIO_Pin_4);
	}
}

